
Функция СохранитьФайлНаДиск(Знач ТабДок, ПараметрыПользователя, ИмяФайла, ТипФайла, id_папки, TeamDrives) Экспорт 
	Возврат GoogleAPI_ПроцедурыРаботыСGDrive.СохранитьТабличныйДокументНаGoogleDrive_multipart(ТабДок, ПараметрыПользователя, ИмяФайла, ТипФайла, id_папки, TeamDrives);
КонецФункции	

Функция ПолучитьСтруктуруИзСтроки(СтрокаСтруктуры) Экспорт 
	Возврат GoogleAPI_Авторизация.ПолучитьСтруктуруИзСтрокиФайлаСКлючами(СтрокаСтруктуры);
КонецФункции	

Функция ПолучитьАктуальнуюСтруктуруGoogleAPIНаСервере() Экспорт 
	
	СтруктураКлючейКонфигурации = GoogleAPI_Авторизация.ПолучитьАктуальнуюСтруктуруGoogleAPI();
	Если СтруктураКлючейКонфигурации = Неопределено Тогда 
		GoogleAPI_ОбщегоНазначения.СообщитьОбОшибкеСПараметрами();
	КонецЕсли;
	
	Возврат СтруктураКлючейКонфигурации;
	
КонецФункции

