
&НаСервере
Процедура ПрограмноеДобавлениеКнопки(Форма) Экспорт 
	
	//проверка подключения подсистемы "СтандартныеПодсистемы.ПодключаемыеКоманды"
	Если СтандартныеПодсистемыСервер.ПараметрРаботыПрограммы("СтандартныеПодсистемы.ПодключаемыеКоманды") = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не подключен параметр работы программы ""СтандартныеПодсистемы.ПодключаемыеКоманды"", добавление кнопки ""Сохранить на Google Drive"" невозможно. 
					|Подключить можно добавив строку ""СтандартныеПодсистемы.ПодключаемыеКоманды"" в регистр сведений ""Параметры работы программы"".");
		Возврат;
	КонецЕсли;	
	
	//определяем тип группы в которую добавить команду
	Если Не Форма.Элементы.Найти("ГруппаГлавное") = Неопределено Тогда
		ТипГруппы = "Главное";
	ИначеЕсли Не Форма.Элементы.Найти("ОсновнаяКоманднаяПанель") = Неопределено Тогда
		ТипГруппы = "Прочее";
	Иначе 
		Возврат;
	КонецЕсли;	
		
	Команды = Новый Массив;
	
	//добавляем команду
	Команда = Форма.Команды.Добавить("GoogleAPI_СохранитьОтчетСФормы");
	Команда.Действие  = "GoogleAPI_СохранитьОтчетКлиент.ОбработкаКомандыПечатиВGS";
	Команда.Картинка  = БиблиотекаКартинок.GoogleDrive_Картинка;
	Команда.Заголовок = НСтр("ru = 'Сохранить на Google Drive'");
	Команда.Подсказка = НСтр("ru = 'Сохранить отчет на Google Drive'");
	Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	Команды.Добавить(Команда);
	
	//выводим команду на форму
	ОтчетыСервер.ВывестиКоманду(Форма, Команды, ТипГруппы, Ложь, Ложь);

КонецПроцедуры
