
&НаКлиенте
Процедура ПослеПолученияКаталогаВремФайлов(РезультатЗакрытия, ДопПараметры) Экспорт 
	
	СтруктураКлючейКонфигурации = ДопПараметры.СтруктураКлючейКонфигурации;
	
	ПроверкаСуществованияФайлаСКлючами(СтрШаблон("%1%2\%3",РезультатЗакрытия, СтруктураКлючейКонфигурации.ИмяПапки, СтруктураКлючейКонфигурации.ИмяФайла), ДопПараметры.ТабДок, СтруктураКлючейКонфигурации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСуществованияФайлаСКлючами(Путь, ТабДок, СтруктураКлючейКонфигурации)
	Файл = Новый Файл(Путь);
	Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ПроверкаСуществованиеФайлаСКлючамиОкончание",ЭтотОбъект,Новый Структура("Путь, ТабДок, СтруктураКлючейКонфигурации", Путь, ТабДок, СтруктураКлючейКонфигурации)));
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСуществованиеФайлаСКлючамиОкончание(Существует, ДополнительныеПараметры) Экспорт
	
	Если Существует Тогда  
		СтрокаСтруктуры = GoogleAPI_АвторизацияКлиент.ПрочитатьФайлСКлючами(ДополнительныеПараметры.Путь);
		СтруктураИзСтроки = GoogleAPI_СохранитьОтчетСервер.ПолучитьСтруктуруИзСтроки(СтрокаСтруктуры);
		ВыбратьИмяФайлаИСохранитьНаДиск(ДополнительныеПараметры.ТабДок, СтруктураИзСтроки);
	Иначе 
		ОткрытьФорму("Обработка.GoogleAPI_АвторизацияПользователя.Форма",,ЭтотОбъект,,,,Новый ОписаниеОповещения("Авторизация_Окончание", ЭтотОбъект, Новый Структура("ТабДок", ДополнительныеПараметры.ТабДок)));		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Функция ПолучитьКлючиДоступаКGoogleAPIИСохранитьФайл(ТабДок)
	
	СтруктураКлючейКонфигурации = GoogleAPI_СохранитьОтчетСервер.ПолучитьАктуальнуюСтруктуруGoogleAPIНаСервере();
	Если СтруктураКлючейКонфигурации = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	НачатьПолучениеКаталогаВременныхФайлов(Новый ОписаниеОповещения("ПослеПолученияКаталогаВремФайлов", ЭтотОбъект, Новый Структура("ТабДок, СтруктураКлючейКонфигурации", ТабДок, СтруктураКлючейКонфигурации)));
	
КонецФункции

&НаКлиенте
Процедура Авторизация_Окончание(РезультатЗакрытия, ДопПараметры) Экспорт 
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") И ТипЗнч(ДопПараметры) = Тип("Структура") Тогда 
		ВыбратьИмяФайлаИСохранитьНаДиск(ДопПараметры.ТабДок, РезультатЗакрытия);
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыбратьИмяФайлаИСохранитьНаДиск(ТабДок, ПараметрыПользователя)
	ОткрытьФорму("ОбщаяФорма.GoogleAPI_ФормаВводаИмениФайла", 
				Новый Структура("ПараметрыПользователя", ПараметрыПользователя), 
				ЭтотОбъект,,,,
				Новый ОписаниеОповещения("ВыборФайла_Окончание", ЭтотОбъект, Новый Структура("ТабДок, ПараметрыПользователя", ТабДок, ПараметрыПользователя)),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры	

&НаКлиенте
Процедура НачатьОткрытиеФайлаЗавершение(Результат, Параметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайла_Окончание(РезультатЗакрытия, ДопПараметры) Экспорт 
	
	Если РезультатЗакрытия = Ложь Тогда // отказались от сохранения 
		Возврат;
	ИначеЕсли ТипЗнч(РезультатЗакрытия) = Тип("Структура") И ТипЗнч(ДопПараметры) = Тип("Структура") Тогда 
		СсылкаНаФайл = GoogleAPI_СохранитьОтчетСервер.СохранитьФайлНаДиск(ДопПараметры.ТабДок, ДопПараметры.ПараметрыПользователя, РезультатЗакрытия.ИмяФайла, РезультатЗакрытия.ТипФайла, РезультатЗакрытия.id_папки, РезультатЗакрытия.TeamDrives);
		Если ЗначениеЗаполнено(СсылкаНаФайл) Тогда 
			Оповещение = Новый ОписаниеОповещения("НачатьОткрытиеФайлаЗавершение", ЭтотОбъект);
			НачатьЗапускПриложения(Оповещение, СсылкаНаФайл);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаКомандыПечати(Источник) Экспорт 
	
	Если ТипЗнч(Источник) = Тип("УправляемаяФорма") Тогда 
		//формируем массив табличных документов, для дальнейшего сохранения в google drive
		МассивТабДок = Новый Массив;
		Для Каждого Эл Из Источник.Элементы Цикл 
			Попытка
				Если ТипЗнч(Эл) = Тип("ПолеФормы") 
					И ТипЗнч(Источник[Эл.Имя]) = Тип("ТабличныйДокумент") Тогда 
					ПолучитьКлючиДоступаКGoogleAPIИСохранитьФайл(Источник[Эл.Имя]);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Источник) = Тип("Форма") Тогда
		//формируем массив табличных документов, для дальнейшего сохранения в google drive
		МассивТабДок = Новый Массив;
		Для Каждого Эл Из Источник.ЭлементыФормы Цикл 
			Попытка
				Если ТипЗнч(Эл) = Тип("ПолеТабличногоДокумента") Тогда 
					ПолучитьКлючиДоступаКGoogleAPIИСохранитьФайл(Эл);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыПечатиВGS(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт 
	
	ОбработкаКомандыПечати(ПараметрКоманды);
	
КонецПроцедуры

